Revit 2027 API
LightDistributionStyle Enumeration
 Tags for specific light distribution styles
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum LightDistributionStyle
Public Enumeration LightDistributionStyle
public enum class LightDistributionStyle
type LightDistributionStyle
Members
Member name | Value | Description
Hemispherical | 1 |  Hemispherical light distribution.
PhotometricWeb | 3 |  Photometric web (IES) light distribution.
Spherical | 0 |  Spherical light distribution.
Spot | 2 |  Spot light distribution.
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace